## 1)Series

In [1]:
import pandas as pd

Q1. Create a Pandas Series from the list [10, 20, 30, 40, 50].

In [2]:
a=pd.Series([10,20,30,40,50])
a

0    10
1    20
2    30
3    40
4    50
dtype: int64

Q2. Create a Pandas Series from a dictionary: {'a': 100, 'b': 200, 'c': 300}.

In [3]:
b=pd.Series({'a':100, 'b':200, 'c':300})
b

a    100
b    200
c    300
dtype: int64

Q3. Access the first three elements of a Series.

In [4]:
a[0:3]

0    10
1    20
2    30
dtype: int64

Q4. Access elements of a Series using index labels.

In [5]:
a[0]

10

Q5. Perform basic operations on Series: addition, subtraction, multiplication, and division with a number.

In [6]:
a+5

0    15
1    25
2    35
3    45
4    55
dtype: int64

In [7]:
a-5

0     5
1    15
2    25
3    35
4    45
dtype: int64

In [8]:
a*2

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [9]:
a/2

0     5.0
1    10.0
2    15.0
3    20.0
4    25.0
dtype: float64

Q6. Filter a Series to get values greater than 25.

In [10]:
a[a>25]

2    30
3    40
4    50
dtype: int64

Q7. Find the sum, mean, max, and min of a Series.

In [11]:
a.sum()

150

In [12]:
a.min()

10

In [13]:
a.max()

50

In [14]:
a.mean()

30.0

## 2)DataFrame Creation

Q8. Create a DataFrame from a dictionary:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25,30,35], 'City': ['NY', 'LA', 'Chicago']}

In [15]:
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25,30,35], 'City': ['NY', 'LA', 'Chicago']}

In [16]:
df = pd.DataFrame(data)
df

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2  Charlie   35  Chicago

Q9. Create a DataFrame from a list of lists and specify column names.

In [17]:
data = (['Sahil',22,2300],['Om',23,4500],['Luv',30,2300],['Vijay',20,6000],['Pratik',34,1000])

In [18]:
df=pd.DataFrame(data, columns=['Name','Age','Salary'])
df

     Name  Age  Salary
0   Sahil   22    2300
1      Om   23    4500
2     Luv   30    2300
3   Vijay   20    6000
4  Pratik   34    1000

Q10. Display the first 3 rows and last 2 rows of a DataFrame.

In [19]:
df.head(3)

    Name  Age  Salary
0  Sahil   22    2300
1     Om   23    4500
2    Luv   30    2300

In [20]:
df.tail(2)

     Name  Age  Salary
3   Vijay   20    6000
4  Pratik   34    1000

Q11. Select a single column from a DataFrame.

In [21]:
df['Name']

0     Sahil
1        Om
2       Luv
3     Vijay
4    Pratik
Name: Name, dtype: object

Q12. Select multiple columns from a DataFrame.

In [22]:
df[['Name','Age']]

     Name  Age
0   Sahil   22
1      Om   23
2     Luv   30
3   Vijay   20
4  Pratik   34

Q13. Select rows using loc and. iloc.

In [23]:
df.loc[0:6]

     Name  Age  Salary
0   Sahil   22    2300
1      Om   23    4500
2     Luv   30    2300
3   Vijay   20    6000
4  Pratik   34    1000

In [24]:
df.iloc[0:6,0:2]

     Name  Age
0   Sahil   22
1      Om   23
2     Luv   30
3   Vijay   20
4  Pratik   34

Q14. Filter rows where Age > 30.

In [25]:
df.loc[df['Age']>30]

     Name  Age  Salary
4  Pratik   34    1000

Q15. Add a new column Salary to an existing DataFrame.

In [26]:
df['Bonus']=[100,200,400,400,300]
df

     Name  Age  Salary  Bonus
0   Sahil   22    2300    100
1      Om   23    4500    200
2     Luv   30    2300    400
3   Vijay   20    6000    400
4  Pratik   34    1000    300

Q16. Drop a column from a DataFrame.

In [27]:
df.drop('Age',axis=1)

     Name  Salary  Bonus
0   Sahil    2300    100
1      Om    4500    200
2     Luv    2300    400
3   Vijay    6000    400
4  Pratik    1000    300

## 3)DataFrame Merging

Q17. Create two DataFrames and merge them using pd.concat.

In [28]:
df1=pd.DataFrame({'ID':[1,2,3],'Name':['Sahil','Om','Ashish']})

In [29]:
df2=pd.DataFrame({'ID':[1,2,4],'Salary':[20000,45000,34000]})

In [30]:
pd.concat([df1,df2])

   ID    Name   Salary
0   1   Sahil      NaN
1   2      Om      NaN
2   3  Ashish      NaN
0   1     NaN  20000.0
1   2     NaN  45000.0
2   4     NaN  34000.0

Q18. Merge two DataFrames using a common column with pd. merge.

In [31]:
pd.merge(df1,df2, on='ID')

   ID   Name  Salary
0   1  Sahil   20000
1   2     Om   45000

Q19. Perform an inner join and outer join between two DataFrames.

In [32]:
pd.merge(df1,df2, on='ID', how='inner')

   ID   Name  Salary
0   1  Sahil   20000
1   2     Om   45000

In [33]:
pd.merge(df1,df2, on='ID', how='outer')

   ID    Name   Salary
0   1   Sahil  20000.0
1   2      Om  45000.0
2   3  Ashish      NaN
3   4     NaN  34000.0

Q20. Sort a DataFrame by a column in ascending and descending order.

In [34]:
df1.sort_values(by='Name')

   ID    Name
2   3  Ashish
1   2      Om
0   1   Sahil

In [35]:
df1.sort_values(by='Name', ascending=False)

   ID    Name
0   1   Sahil
1   2      Om
2   3  Ashish